OdDAI.SelectType.setSelections(OdArray&lt;OdDAI.NamedType!System.Runtime.CompilerServices.IsConst**,OdObjectsAllocator&lt;OdDAI.NamedType!System.Runtime.CompilerServices.IsConst**&gt;&gt;!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets a new set of selectable data types for the select data type.
\param selections [in] An OdArray that contains the selectable data types to be set.

OdDAI.SelectType.m_selections
An STD set object that contains selectable data types associated with the select data type.

OdDAI.SelectType.selections
\details
Retrieves the set of selectable data types associated with the select data type.
\returns An STD set object that contains selectable data types.

OdDAI.SelectType.type
\details
Retrieves a type code of the Select type.
\returns A smart pointer to the type code of the Select type.

OdDAI.SelectType.#ctor
\details
Creates a new select data type object with default parameters.

OdDAI.SelectType
\details
A class that implements the storing of arbitrary SELECT type meta-data defined within an EXPRESS SCHEMA.